<script setup lang="ts">
import { ref } from "vue";

const dropdowns = ref([
  {
    title: "Аффинаж",
    isVisible: false,
    options: ["Способ ухода за сыром во время его созревания."],
  },
  {
    title: "Аффинер",
    isVisible: false,
    options: [
      "Специалист по сыроделию, контролирующий самые важные характеристики в период созревания продукта - температуру и влажность, для того чтобы сыр приобрел нужные вкус, консистенцию и запах.",
    ],
  },
  {
    title: "Процесс пастеризации",
    isVisible: false,
    options: [
      "Нагревание молока до высокой температуры для уничтожения вредных бактерий. Выделяют следующие типы пастеризации: Мягкая - молоко нагревается до температуры в 65-67 градусов, которая поддерживается в течение 10-20 минут. После этого жидкость подвергается охлаждению до необходимой температуры. Основная - молоко нагревается до температуры в 72-73 градуса, которая удерживается на протяжении 15 секунд, после чего жидкость быстро подвергают охлаждению. Ультрапастеризация - воздействие на молоко промышленным способом при помощи быстрого нагревания до высокой температуры с последующим очень быстрым охлаждением. В процессе сыроварения применяют мягкую и основную пастеризации. Если молоко ультрапастеризованное, сыр приготовить не удастся, поскольку в процессе будет разрушен кальций, что повлияет на сгусток сыра, а, точнее, на его отсутствие.",
    ],
  },
  {
    title: "Калье",
    isVisible: false,
    options: ["Необработанная сырная масса."],
  },
  {
    title: "Закваска",
    isVisible: false,
    options: [
      "Сочетание необходимых для ферментации бактерий. Существует три вида закваски, каждый из которых наделяет сыр своим уникальным вкусом и ароматом: Термофильная закваска - состоит из бактерий, которые наделяют сыр молочными и пряными нотками во вкусе. Оптимальная температура ферментации 37-45 градусов; Мезофильная закваска - состоит из бактерий, которые наделяют сыр молочным и сливочным вкусом. Оптимальная температура ферментации 32-37 градусов; Мезофильно-термофильная закваска - сочетание указанных выше заквасок в определенном количестве для создания конкретного вида сыра.",
    ],
  },
  {
    title: "Молоко",
    isVisible: false,
    options: [
      "Молоко – продукт природного происхождения. Он продуцируется самками млекопитающих на стадии лактации. В сырном производстве чаще всего используется коровье, овечье и козье молоко. Качество этого продукта оценивается по нескольким факторам, среди которых: Свежесть. Только здоровые животные вырабатывает молоко, свежесть которого сохраняется в течение двух суток и более; Чистота. В составе чистого продукта отсутствуют вредные бактерии (молочнокислые бактерии, антибиотики), которые способны испортить вкусовые и ароматические свойства сыра и вызвать его преждевременную порчу; Соотношение белков и жиров. Дозировка этих веществ напрямую влияет на некоторые свойства сыра. Белок определяет объем готового сырного продукта, а также влияет на его плотность. В сырном производстве используют молоко, в составе которого от 3% белка. От жирности сырья зависит эластичность и вкус будущего сырного продукта. При недостатке этого вещества сыр выходит «резиновым», а при его избытке – получает горьковатый привкус; Термоустойчивость. Этот показатель отражается на стабильности белка, на стадии его нагревания. От этого фактора зависит степень коагуляции (свертывания) белка при его разогреве. Плотность. Средние показатели плотности качественного молочного сырья - 1027-1033 кг/м3.",
    ],
  },
  {
    title: "Сепарирование",
    isVisible: false,
    options: [
      "Процесс обезжиривания молока с использованием сепаратора. Эта технология используется обычно при производстве твердых или полутвердых видов сыра для того, чтобы добиться необходимого количества белков и жиров, а также не допустить возникновения прогорклого вкуса и запаха у конечного продукта.",
    ],
  },
  {
    title: "Пороки сыра",
    isVisible: false,
    options: [
      "Пороки вкуса и запаха: кислый и невыраженный вкус, горький вкус, прогорклый вкус, привкус кормов; Пороки консистенции: крошливое тесто, самокол (колющееся тесто), мажущееся тесто, расплывающаяся консистенция; Пороки рисунка: сетчатый рисунок, губчатый рисунок, пустотный рисунок; Пороки цвета сырного теста: бледный цвет теста; Пороки сырной корки: толстая корка, слабая корка, трещины на корке.",
    ],
  },
  {
    title: "Хлористый кальций",
    isVisible: false,
    options: [
      "Вещество, которое добавляют в молоко после пастеризации для того чтобы увеличить количество кальция в жидкости, которое она потеряла в процессе нагревания.",
    ],
  },
  {
    title: "Дренаж сыра",
    isVisible: false,
    options: [
      "Процесс отдачи сырной массой жидкости (сыворотки). В процессе дренажа сыр приобретает плотную и упругую форму. Дренаж осуществляют сразу после того как сыр был помещен в формы и в условиях соблюдения комнатной температуры.",
    ],
  },
  {
    title: "Кислотность",
    isVisible: false,
    options: [
      "Кислотность - это один из основоположных критериев определения качества сырья в сырном производстве. Кислотность и Ph состоят в обратной зависимости. При высокой кислотности снижается Ph, и наоборот. Этот показатель влияет на период дозревания и хранения, консистенцию готового продукта.",
    ],
  },
  {
    title: "Посол",
    isVisible: false,
    options: [
      "Процесс добавления соли очень важен не только для достижения необходимого вкуса, но и для организации необходимых физико-химических процессов приготовления сыра. Если добавить недостаточно соли, или, наоборот, слишком много, это может привести к образованию пороков, которые негативно скажутся на свойствах готового сыра. Чтобы этого не произошло, важно точно придерживаться дозировок, указанных в рецепте. В мягких видах сыра применяют сухой посол. Он подразумевает определение веса готовой головки сыра, после чего производится расчет соли, требуемой для просола продукта. В твердые и полутвердые сыры добавляют солевой раствор разной насыщенности. От этих особенностей зависит сколько времени потребуется на просолку сыра.",
    ],
  },
  {
    title: "Ph-метр",
    isVisible: false,
    options: [
      "Прибор мастера-сыродела, при помощи которого достигается получение высококачественного продукта сострогим соблюдением технологических карт и необходимого уровня кислотности молока, сырной массы, сыворотки и готового продукта.",
    ],
  },
]);

function toggleDropdown(index: number) {
  dropdowns.value[index].isVisible = !dropdowns.value[index].isVisible;
}
</script>

<template>
  <div class="flex gap-10 font-sans text-xxs w-full">
    <MenuSection />
    <div class="mt-6 w-[75%]">
      <h1 class="text-3xl font-bold opacity-45">Справочник сыродела</h1>
      <main v-for="(dropdown, index) in dropdowns" :key="index">
        <div
          class="flex items-center justify-between py-1 px-4 bg-yellow-200 rounded-lg mt-4 cursor-pointer"
          @click.prevent="toggleDropdown(index)"
        >
          <div to="" class="text-black transition px-2 py-3 text-2xl">
            {{ dropdown.title }}
          </div>
          <NuxtImg
            :src="
              dropdown.isVisible
                ? '/down-arrow.png'
                : '/right-arrow-angle.png'
            "
            alt="Arrow Icon"
            class="w-4 h-4 transform transition-transform"
            :class="dropdown.isVisible ? 'rotate-180' : ''"
          />
        </div>
        <div
          v-if="dropdown.isVisible"
          class="mt-2 bg-white border rounded shadow-lg"
        >
          <p
            v-for="(option, i) in dropdown.options"
            :key="i"
            class="block px-4 py-2 text-gray-700 hover:bg-yellow-800 hover:text-white transition"
            to=""
          >
            {{ option }}
          </p>
        </div>
      </main>
    </div>
  </div>
</template>
